{
    "Revtura":{
        "nom" : "Revtura",
        "miniature": "/revtura/revtura.png",
        "titre" : "Revtura",
        "info" : "Le réseau des voyageurs",
        "titre1": "Un projet collectif",
        "paragraphe1": "Revtura est un site fictif réalisé en 2ème semestre de DUT MMi (Métiers des Multimédia et de lInternet). Issus d'un travail de groupe nous devions nous organiser afin de produire un site répondant à différentes contraintes a l'image d'un projet pro. Revtura est ce qui s'approche le plus d'un réseau social pour voyageur. L'utlisateur a donc la possibilité d'utiliser de nombreuses fonctionnalités comme la gestion d'un compte, la gestion de contenu ou encore de la géolocalisation.",
        "photo1": "/revtura/accueil.png",
        "couleurs": {
            "c1" : "#0A8EDA",
            "c2" : "#F2F2F2",
            "c3" : "#FFAE26",
            "c4" : "#006C89"
        },
        "titre2": "Charte graphique",
        "paragraphe2": "Promettant aux utilisateurs qu’ils pourront partager leurs expériences de voyages et de découvrir celle des autres nous avons donc choisi le nom Revtura qui les deux mots latin Reveles et Cultura qui se traduisent par Découvrir et Culture. De la est né notre harmonié colorée ainsi que la sélection des typographie.",
        "paragraphe2bis" : "La création du logo suit aussi le ton donnée au site. Le choix d'un PIN pour la destination choisie par les utilisateurs et la flèche de validation symbolisant la sureté et faisant référence à un oiseau de dos.",
        "photo2": "/revtura/landingPage.png"
    },

    "JeanBauhin":{
        "nom" : "JeanBauhin",
        "miniature": "/jeanBauhin/jeanbauhin.png",
        "titre" : "Jean Bauhin",
        "info" : "Site du collège Jean Bauhin",
        "titre1": "Projet professionel",
        "paragraphe1": "Le site du collège Jean Bauhin est projet tutoré qui a pour vocation de nous plongé dans l'univers professionnel. Fini les projets fictifs nous nous sommes retrouvés face à des commanditaires bien réel. Plus qu'un exercice, le droit à l'erreur n'était pas envisageable. L'objectif de ce projet était de réaliser le site web du collège Jean Bauhin d'Audincourt répondant à une problématique d'image avec toutes les contraintes d'un site hébergé par l'académie de Besançon.",
        "photo1": "/jeanBauhin/grilleMockup.png",
        "couleurs": {
            "c1" : "#8F1A1A",
            "c2" : "#F5ECEC",
            "c3" : "#454444"
        },
        "titre2": "Réalisation technique",
        "paragraphe2": "Avant de commencer à développer le site il a fallu réfléchir aux cas d'utilisation et aux diagrammes d'activité du produit. En adéquation avec les contraintes imposées par l'académie de Besançon (versions, plugins…) le développement pouvait commencer. Le site est développé sous Wordpress afin de faciliter l'enrichissement du site par les commanditaires. En plus des fonctionnalités proposées par WordPress sur le sujet j'ai décidé d'utiliser le plugin ACF qui permet de créer des champs personnalisés. L'idée étant de limiter le client dans la structure de la page afin de ne pas en bouleversé la disposition de ses éléments.",
        "photo2": "/jeanBauhin/accueil.png"
    },

    "RelevesNotes":{
        "nom" : "RelevesNotes",
        "miniature": "/releveNotes/mmi.jpg",
        "titre" : "Relevé de Notes",
        "info" : "Notes des étudiants MMi",
        "titre1": "Développement Mobile",
        "paragraphe1": "Ce projet en duo clôture le chapitre sur le développement mobile. Nous devons réaliser une application reposant sur le Framework ionic. L'application doit répertorier l'ensemble des élèves des deux promotions ainsi que leur relevé de notes. On obtient donc une liste avec toutes les personnes de la promotion ainsi qu'une fiche leur correspondant contenant leur moyenne du semestre.",
        "photo1": "/releveNotes/ficheEleves.png",
        "titre2": "Réalisation technique",
        "paragraphe2": "Une fois le projet créé, nous avons organisé les routes avec chacune un template et un controller qui leur corresponde. Le controller va chercher les données récupérer par le service Ajax. Ce dernier récupère donc un json stocké en local et nous pouvons ensuite restituer toutes ses données dans un template. Il suffit ensuite de faire une boucle et ainsi afficher l'intégralité des éléments contenus dans le fichier json",
        "photo2": "/releveNotes/service.png"
    },

    "Photobox":{
        "nom" : "Photobox",
        "miniature": "/photobox/photobox.png",
        "titre" : "Photobox",
        "info" : "Application de partage de photos",
        "titre1": "Le concept de ce service",
        "paragraphe1": "PhotoBox est une application amicale qui permet aux utilisateurs de rejoindre des évenements et d’en garder un souvenir. La philosophie de l'application est de réunir les utilisateurs autour de la photo et de la fête.  Ainsi depuis l’application ils pourront rejoindre les évènements qui les intéressent et y poster des photos, qui seront disponibles à tous si l’évènement est publique ou seulement aux invités si l’évènement est privé.",
        "photo1": "/photobox/login.jpg",
        "couleurs": {
            "c1" : "#824AA7",
            "c2" : "#EEEEEE",
            "c3" : "#3F2D86"
        },
        "titre2": "Architecture",
        "paragraphe2": "Pour donner vie à ce service nous avons décidé de le structurer de la manière suivante. Une application mobile permettant aux utilisateurs d'interagir avec notre service. Cette application communique avec une API qui est connectée à une base MongoDB. Un playeur est également mis en place afin de projeter les photos prises par les utilisateurs.",
        "photo2": "/photobox/architecture.png"
    },

    "Mediatheque":{
        "nom" : "Mediatheque",
        "miniature": "/mediatheque/mediatheque.png",
        "titre" : "Médiathèque",
        "info" : "Outil de gestion de médiathèque",
        "titre1": "Atelier",
        "paragraphe1": "Ce projet a été réalisé dans le cadre d'un exercice. Le but était de construire une application de gestion de médiathèque selon un cahier des charges. Ce projet a été réalisé sur une semaine et comportait en plus de la programmation des rendus graphique et technique. Ici pour travailler avec notre base de données pas de framework. Pour nous aider, durant la première partie du semestre nous avions développé un micro framework permettant d'utiliser des calss pour faciliter nos requêtes.",
        "photo1": "/mediatheque/login.png",
        "couleurs": {
            "c1" : "#34B3AA",
            "c2" : "#E8E8E8",
            "c3" : "#707070"
        },
        "titre2": "Programmation et fonctionnement",
        "paragraphe2": "Ce projet comportait en réalité 2 applications. L'une déstinée aux clients de la médiathèque servant à consulter les ouvrages disponibles et faire une demande d'emprunt. La deuxième application devait servir au personnel de la médiathèque qui avait la possibilité de gérer les stocks et d'attribuer des emprunts.",
        "paragraphe2bis" : "Les applications comportaient également les fonctionnalités types comme un système de login, une gestion des comptes ou encore une gestion des utilisateurs.",
        "photo2": "/mediatheque/liste.png"
    },

    "HLP":{
        "nom" : "HLP",
        "miniature": "/hlp/hlp.jpg",
        "titre" : "Hlp group",
        "info" : "Digitilisation de processus métier",
        "titre1": "Un projet collectif",
        "paragraphe1": " Les actions qui m’ont été demandées portent essentiellement sur la refonte graphique ainsi que du développement principalement côté client. Cette application accompagne les opérateurs dans leurs routine afin de digitaliser des processus pour l’industrie.",
        "photo1": "/hlp/tdt.png",
        "titre2": "Mon role dans ce projet",
        "paragraphe2": "Mon travail sur ce projet a été de proposer une refonte graphique de chaque fonctionnalité de l'application. J'ai donc dans un premier temps beaucoup travaillé sur l'aspect graphique et ergonomique du projet. Une fois ces modifications validées, viens le temps d'intégrer ce nouveau design au projet.",
        "paragraphe2bis" : "Chaque fonctionnalité nécessitait de comprendre le logique métier afin d'adapter au mieux l'application pour l'utilisateurs. Chaque fonctionnalité apportait son lot de nouveautés et de nouveaux problèmes à résoudre. Sagissant d'une refonte graphique, dans la majorité des cas la logique de l'application était fonctionnelle ne nécessitant pas beaucoup d'ajout.",
        "photo2": "/hlp/mockupDS.png"
    }
}